<?php
    $name = "이의진";
    echo $name,",님 환영합니다 <br>";
    // echo "$name 님화영합니다" 띄어쓰기 안하면 안됨
    // echo "($name) 님 환영합니다" 가능
    //<?=$name>
    //문자열 연결 연산자 ,
    // "$num,"-",num2"
    
    
    // 배열 쓰는 법
    // $a =array(,1,68,6,486,4,,654,6,,)
    //이중 배열
    //$ㅁ = array((1,2,346,6,869,4),(,13,456,343,86,86,18,35,))

    //함수 정의
    //function hello(){내용}


    //html
    //문서의 정보를 담는 <head></head>
    //브라우저에 출력할 내용을 <body></body>
    //ID,PW 작성 창 같이 폼이 있는 페이지는 <form></form>

    //url 전달
    //get 방식 url에 사용자가 입력한게 그대로 보임 (뭐가)제한
    //post방식 url에 사용자가 입력한게 보이지 않음 무제한

?>

<?= $name, "환영합니다." ?> 
